app/Http/Controllers/Auth/LoginController.php

            }

            return redirect('admin');
        } else if ($user = User::withTrashed()->where('email',$credentials['email'])->first()) {
---
select * from `users` where `email` = 'callum@wearethunderbolt.com' limit 1