app/Http/Controllers/Auth/MarketplaceController.php

    public function store(Request $request)
    {
        try{
            $user = User::find($request->user_id);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1