app/Phase/AudioTranscoder.php

    public function transcodeStreamable()
    {
        $filename = Str::random(40) . '.mp3';
        $elasticTranscoder = AWS::createClient('ElasticTranscoder');
        if (isset($this->track->asset->files['mp3'])) {
            $file = $this->track->asset->files['mp3']->path;
        } else {
            $file = $this->track->asset->files['wav']->path;
        }

        $elasticTranscoder->createJob([
            'PipelineId' => env('AWS_ET_AUDIO_PIPELINEID'),
            'Input' => [
                // Input File
                'Key' => $file,
            ],
            'OutputKeyPrefix' => $this->streamaleOutputDir,
            'Outputs' => [
                [
                    'Key' => $filename,
                    'PresetId' => env('AWS_ET_AUDIO_STREAMABLE_PRESETID'),
                ]
            ],
        ]);

        $this->createStreamableAssetModel();
---
insert into `assets` (`alt`, `updated_at`, `created_at`) values ('Track Preview', '2022-12-30 07:39:29', '2022-12-30 07:39:29')

    private function associatePreviewWithTrack()
    {
        $this->track->preview_id = $this->previewAsset->id;
        $this->track->save();
---
update `tracks` set `preview_id` = 228, `tracks`.`updated_at` = '2022-12-30 07:39:29' where `id` = 570

    private function associateStreamableWithTrack()
    {
        $this->track->streamable_id = $this->streamableAsset->id;
        $this->track->save();
---
update `tracks` set `streamable_id` = 229, `tracks`.`updated_at` = '2022-12-30 07:39:29' where `id` = 570