app/Track.php

    public function saveTrackFile($file, $format)
    {
        $asset = Asset::create([
            'alt' => 'Original Track'
        ]);
        $this->asset_id = $asset->id;
        $this->save();

        $id3 = new \getID3();
        $trackData = $id3->analyze($file, $file->getSize(), $file->getClientOriginalName());
        $fileFormat = $trackData['fileformat'];
        $fileRandom = Str::random(40);
        $localPath = Storage::disk('public')->putFileAs('temp/tracks', $file,  $fileRandom . '.' . $fileFormat);
        $path = Storage::putFileAs('tracks', $file, $fileRandom . '.' . $fileFormat, 'private');

        $this->length = floor($trackData['playtime_seconds']);
        $this->save();

        $fileModel = File::create([
            'asset_id' => $asset->id,
            'size' => $trackData['fileformat'],
            'path' => $path,
            'mime' => Storage::mimeType($path),
        ]);
---
insert into `assets` (`alt`, `updated_at`, `created_at`) values ('Original Track', '2022-12-30 07:39:27', '2022-12-30 07:39:27')
update `tracks` set `asset_id` = 227, `tracks`.`updated_at` = '2022-12-30 07:39:27' where `id` = 570
update `tracks` set `length` = 4, `tracks`.`updated_at` = '2022-12-30 07:39:27' where `id` = 570
insert into `files` (`asset_id`, `size`, `path`, `mime`, `updated_at`, `created_at`) values (227, 'mp3', 'tracks/ehBkSZFlN05D09ya45Yt5l2iaPH4W2OwyLCDEXLN.mp3', 'audio/mpeg', '2022-12-30 07:39:28', '2022-12-30 07:39:28')