app/User.php

    public function getAvatarAttribute()
    {
        if ($this->avatar_id) {
            return $this->avatar()->first();
        } else {
            return Asset::find(2);
---
select * from `assets` where `assets`.`id` = 2 limit 1