routes/api/country.php

<?php

Route::get('/countries', function () {
    return \DB::table("countries")->distinct("iso_code")->get();
---
select distinct * from `countries`