routes/api/newmusic.php

select `id`, `name`, `class`, `status`, `image_id`, `uploaded_by`, `created_at` from `releases` where `releases`.`id` in (4, 90, 171, 199, 210, 224, 278, 304, 346, 378, 386, 399, 470, 471, 472) and `releases`.`deleted_at` is null
---
        ->with([
            'preview' => function ($query) {
                $query->select('id', 'created_at');
            },
            'release' => function ($query) {
                $query->select([
                    'id', 'name', 'class', 'status', 'image_id', 'uploaded_by', 'created_at', 'release_date'
                ]);
            },
            'release.uploader' => function ($query) {
                $query->select('id', 'name', 'path');
            },
            'release.image',
        ])
        ->whereHas('release', function($query) {
                    $query->statuslive();
            })
        ->withCount([
            'comments as comments_count', 'likes as likes_count', 'shares as shares_count'
        ])
        ->where('status', 'approved')
        ->take($count)
        ->orderByDesc('created_at')
        ->paginate(15);