routes/api/news.php

select `id`, `name`, `first_name`, `last_name`, `path` from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
---
});
Route::get('/news/{count?}', function ($count = 10) {
    // return Cache::remember('news:'.$count, now()->addHours(12), function () use ($count) {
    return News::published()
        ->with([
            'image',
            'user' => function ($q) {
                return $q->select('id', 'name', 'first_name', 'last_name', 'path');
            },
        ])
        ->withCount('comments as comments_count', 'likes as likes_count', 'shares as shares_count')
        ->orderByDesc("id")
        ->paginate($count);

select * from `assets` where `assets`.`id` in (3, 4, 8, 10, 13, 14, 15, 25, 26)
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
select `categories`.*, `category_news`.`news_id` as `pivot_news_id`, `category_news`.`category_id` as `pivot_category_id` from `categories` inner join `category_news` on `categories`.`id` = `category_news`.`category_id` where `category_news`.`news_id` in (50)
select * from `assets` where `assets`.`id` in (26)
---
    // });
});

Route::get('/news/article/{id}', function ($identifier) {
    if (is_numeric($identifier)) {
        return News::with('user', 'image', 'categories')
            ->withCount([
                'comments as comments_count', 'likes as likes_count', 'shares as shares_count'
            ])->findOrFail($identifier);
    }
    // FIXME: check all pages for this path
    return News::wherePath($identifier)
        ->with([
            'categories' => function ($q) {
                $q->select('categories.id', 'categories.title', 'categories.path');
            },
            'image' => function ($q) {
                $q->select('assets.id', 'assets.created_at');
            },
            'user' => function ($query) {
                $query->select('users.id', 'users.name', 'users.path');
            }
        ])
        ->withCount([
            'shares as shares_count', 'likes as likes_count', 'comments as comments_count'
        ])
        ->firstOrFail();