routes/api/releases.php

 * {id} row id of release
 **/
Route::get('/release/{release}', function (Release $release) {
    $returnRelease = $release->load('uploader', 'image', 'genres')->load([
        'tracks' => function ($query) {
            return $query->where('status', 'approved');
        }, 'tracks.artist', 'tracks.asset.files', 'tracks.release'
    ]);
---
select * from `files` where `files`.`asset_id` in (54)
select * from `tracks` where `tracks`.`release_id` in (349) and `status` = 'approved' and `tracks`.`deleted_at` is null
select * from `assets` where `assets`.`id` in (32)
select `genres`.*, `release_track_genres`.`release_id` as `pivot_release_id`, `release_track_genres`.`genre_id` as `pivot_genre_id` from `genres` inner join `release_track_genres` on `genres`.`id` = `release_track_genres`.`genre_id` where `release_track_genres`.`release_id` in (349) and `genres`.`deleted_at` is null