routes/api/user.php



Route::get('artist-types', function () {
    return \App\ArtistType::where("id", ">", 0)->get();
---
select * from `artist_types` where `id` > 0