app/Http/Controllers/ApiReleaseController.php

        $data['release_date'] = Carbon::createFromTimestampMs($data['release_date'])->addHour(1);
        $data['uploaded_by'] = $user->id;

        $release = Release::create($data);
---
insert into `releases` (`name`, `description`, `price`, `class`, `release_date`, `status`, `uploaded_by`, `slug`, `updated_at`, `created_at`) values ('single 110', 'sadasdasd', '300', 'single', '2022-12-30 01:00:00', 'pending', 1, 'single-110', '2022-12-30 07:39:21', '2022-12-30 07:39:21')


        /** Handle all tracks */
        foreach ($request->tracks as $key => $track) {
          $newTrack = Track::create([
            'name' => $track['name'],
            'bpm' => $track['bpm'],
            'key' => $track['key'],
            'price' => $track['price']
          ]);
          $newTrack->release_id = $release->id;
          $newTrack->uploaded_by = $request->user()->id;
          $newTrack->save();
---
insert into `tracks` (`name`, `bpm`, `key`, `price`, `slug`, `updated_at`, `created_at`) values ('single 110', '46', 'a', '300', 'single-110', '2022-12-30 07:39:27', '2022-12-30 07:39:27')
update `tracks` set `release_id` = 578, `uploaded_by` = 1, `tracks`.`updated_at` = '2022-12-30 07:39:27' where `id` = 570


        event(new UserUploadedRelease($release));

        return Release::findOrFail($release->id);
---
select * from `releases` where `releases`.`id` = 578 and `releases`.`deleted_at` is null limit 1