app/Http/Controllers/ChartController.php

                })
                ->with([
                    'uploader' => function ($query) {
                        $query->select('id', 'name', 'first_name', 'last_name', 'path');
                    },
                    'image' => function ($query) {
                        $query->select('id', 'created_at');
                    },
                    'tracks' => function ($query) {
                        $query->select([
                            'id', 'name', 'length', 'created_at', 'bpm', 'key', 'preview_id', 'asset_id',
                            'release_id', 'uploaded_by', 'status', 'slug'
                        ]);
                    },
                    'tracks.streamable',
                    'tracks.release' => function ($query) {
                        $query->select('id', 'name', 'created_at', 'class', 'uploaded_by', 'status', 'image_id');
                    },
                    'tracks.release.uploader' => function ($query) {
                        $query->select('id', 'name', 'path');
                    },
                    'tracks.preview',
                ])
                ->get()
                ->groupBy('class');
---
select `id`, `name`, `created_at`, `class`, `uploaded_by`, `status`, `image_id` from `releases` where `releases`.`id` in (4, 8, 9, 13, 14, 15, 19, 24, 26, 34, 41, 43, 46, 48, 54, 55, 57, 58, 64, 65, 67, 68, 75, 78, 80, 83, 90, 91, 92, 94, 99, 102, 103, 110, 111, 112, 117, 121, 133, 136, 140, 142, 144, 145, 150, 168, 171, 190, 197, 199) and `releases`.`deleted_at` is null
select `id`, `name`, `length`, `created_at`, `bpm`, `key`, `preview_id`, `asset_id`, `release_id`, `uploaded_by`, `status`, `slug` from `tracks` where `tracks`.`release_id` in (4, 8, 9, 13, 14, 15, 19, 24, 26, 34, 41, 43, 46, 48, 54, 55, 57, 58, 64, 65, 67, 68, 75, 78, 80, 83, 90, 91, 92, 94, 99, 102, 103, 110, 111, 112, 117, 121, 133, 136, 140, 142, 144, 145, 150, 168, 171, 190, 197, 199) and `tracks`.`deleted_at` is null