app/Http/Controllers/DiscoverController.php

                    });
                }
            })
            ->with([
                'image',
                'uploader' => function ($query) {
                    $query->select('id', 'name', 'first_name', 'last_name', 'path');
                },
                'tracks',
                'tracks.preview',
                'tracks.release' => function ($query) {
                    $query->select('id', 'name', 'created_at', 'class', 'uploaded_by', 'status');
                },
                'tracks.release.uploader' => function ($query) {
                    $query->select('id', 'name', 'path');
                },
            ])
            ->withCount([
                'comments as comments_count',
                'likes as likes_count',
                'shares as shares_count'
            ])
            ->orderBy($column, $direction)
            ->paginate(15);
---
select * from `tracks` where `tracks`.`release_id` in (24, 34, 58, 102, 111, 142, 190, 197, 199, 202, 310, 332, 349, 365, 366, 378, 390, 395, 398, 409, 421, 422, 437, 470, 472) and `tracks`.`deleted_at` is null
select `id`, `name`, `created_at`, `class`, `uploaded_by`, `status` from `releases` where `releases`.`id` in (24, 34, 58, 102, 111, 142, 190, 197, 199, 202, 310, 332, 349, 365, 366, 378, 390, 395, 398, 409, 421, 422, 437, 470, 472) and `releases`.`deleted_at` is null