app/Http/Controllers/EventController.php

    public function listForUser($userId)
    {
        $user = User::findOrFail($userId);

        return $user->events()->with("user")
            ->orderByDesc('created_at')->get();
---
select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1
select * from `events` where `events`.`user_id` = 1 and `events`.`user_id` is not null order by `created_at` desc
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null