app/Http/Controllers/FeedController.php

select * from `assets` where `assets`.`id` in (53)
select * from `videos` limit 8
---
    public function index()
    {
        // 6 hours
        $cache_seconds = now()->addMinutes(30);
        $cache_token = 'feed';

        try {

            $cached_result = Cache::remember($cache_token, $cache_seconds, function () {

                $default_limit = 10;
                $collection = collect([]);

                /*Release::statuslive()->with([
                    'image',
                    'uploader' => function ($query) {
                        $query->select('id', 'name', 'path');
                    },
                ])->withCount('shares', 'comments', 'likes')->limit(10)->get()->each(function ($item) use (&$collection) {
                    $item->component = 'feed-release';
                    $item->type = 'release';
                    $collection->push($item);
                });*/
                Track::namenotnull()->isApproved()->with([
                    'preview',
                    'release',
                    'release.image',
                    'release.uploader' => function ($query) {
                        $query->select('id', 'name', 'path');
                    },
                ])->whereHas('release', function ($query) {
                    $query->statuslive();
                })->with('asset')->limit(10)->get()->each(function ($item) use (&$collection) {
                    $item->component = 'feed-track';
                    $item->type = 'track';
                    $collection->push($item);
                });
                if (auth()->check()) {

                    Video::limit(8)->get()->each(function ($item) use (&$collection) {
                        $item->component = 'feed-video';
                        $item->type = 'video';
                        $collection->push($item);
                    });