app/Http/Controllers/MerchController.php

select count(*) as aggregate from `merches`
---
    public function index()
    {
        return Merch::with('user')->paginate(15);