app/Http/Controllers/UserController.php

    public function getActivityForUser($userID, Request $request)
    {
        $user = User::findOrFail($userID);
---
select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1

    public function getMerchForUser($userID)
    {
        return User::findOrFail($userID)->merch()->with("user")
            ->orderByDesc('created_at')->get();
---
select * from `merches` where `merches`.`user_id` = 1 and `merches`.`user_id` is not null order by `created_at` desc