app/Http/Controllers/Account/MyReleases.php

    public function index()
    {
        return Release::where('uploaded_by', auth()->id())
            // ->where(function ($query) {
            //     $query->where('status', 'live');
            //     $query->where('release_date', '<=', date('Y-m-d'));
            // })
            // ->orWhere('status', '!=', 'live')
            ->with([
                'image',
                'tracks',
                'tracks.artist',
                'genres',
                'tracks.preview',
                'tracks.release',
                'uploader' => function ($query) {
                    $query->select(['id', 'name', 'path']);
                }
            ])
            ->latest('release_date')
            ->paginate(10);
---
select `genres`.*, `release_track_genres`.`release_id` as `pivot_release_id`, `release_track_genres`.`genre_id` as `pivot_genre_id` from `genres` inner join `release_track_genres` on `genres`.`id` = `release_track_genres`.`genre_id` where `release_track_genres`.`release_id` in (567, 568, 569, 570, 571, 572, 573, 574, 577, 578) and `genres`.`deleted_at` is null