app/Http/Controllers/Account/MyReleases.php

    public function index()
    {
        return paginateOrAll(Release::where('uploaded_by', Auth::id())->with('tracks', 'uploader'), 15, 'release_date');
---
select * from `releases` where `uploaded_by` = 1 and `releases`.`deleted_at` is null order by `release_date` desc limit 10 offset 0
select * from `tracks` where `tracks`.`release_id` in (567, 568, 569, 570, 571, 572, 573, 574, 577, 578) and `tracks`.`deleted_at` is null
select count(*) as aggregate from `releases` where `uploaded_by` = 1 and `releases`.`deleted_at` is null