app/Http/Controllers/Account/SubscriptionController.php

select * from `plans` where `price` > 0
---
    public function getPlans()
    {
        return Plan::where('price', '>', 0)->get();